Repository: bottlepy/bottle
Catalog: docs/_locale/*/LC_MESSAGES/faq.po
Languages: de_de

source: Frequently Asked Questions
de_de: Häufig gestellte Fragen

source: About Bottle
de_de: Über Bottle

source: Is bottle suitable for complex applications?
de_de: Ist Bottle für komplexe Anwendungen geeignet?

source: Bottle is a *micro* framework designed for prototyping and building small web applications and services. It stays out of your way and allows you to get things done fast, but misses some advanced features and ready-to-use solutions found in other frameworks (MVC, ORM, form validation, scaffolding, XML-RPC). Although it *is* possible to add these features and build complex applications with Bottle, you should consider using a full-stack Web framework like pylons_ or paste_ instead.
de_de: Bottle ist ein *micro*-Framework, entworfen für Prototyping und kleine Webanwendungen und -services. Es hält sich im Hintergrund und erlaubt es dir die Dinge schnell erledigt zu bekommen, ihm fehlen allerdings einige fortgeschnittenere Eigenschaften und ready-to-use Lösungen wie sie in anderen Frameworks zu finden sind (MVC, ORM, Formularvalidierung, Scaffolding, CML-RPC). Auch *wenn* es möglich ist diese hinzuzufügen und komplexere Anwendungen mit Bottle zu entwickeln, solltest du in Betracht ziehen ein vollwertiges Web-Framework wie pylons oder paste zu benutzen.

source: Common Problems and Pitfalls
de_de: Häufige Probleme und Fallstricke

source: "Template Not Found" in mod_wsgi/mod_python
de_de: "Template nicht gefunden" in mod_wsgi/mod_python

source: Bottle searches in ``./`` and ``./views/`` for templates. In a mod_python_ or mod_wsgi_ environment, the working directory (``./``) depends on your Apache settings. You should add an absolute path to the template search path::
de_de: Bottle sucht in ``./`` und ``./views/`` nach Templates. In einer mod_python_ oder mod_wsgi_ Umgebung hängt das Arbeitsverzeichnis (``./``) von deinen Apache Einstellungen ab. Du solltest dem Templatepfad einen absoluten Pfad hinzufügen

source: so bottle searches the right paths.
de_de: damit Bottle den richtigen Pfad nutzt.

source: Dynamic Routes and Slashes
de_de: Dynamische Routen und Schrägstriche

source: Problems with reverse proxies
de_de: Probleme mit Reverse-Proxies

source: Redirects and url-building only works if bottle knows the public address and location of your application. If you run bottle locally behind a reverse proxy or load balancer, some information might get lost along the way. For example, the ``wsgi.url_scheme`` value or the ``Host`` header might reflect the local request by your proxy, not the real request by the client. Here is a small WSGI middleware snippet that helps to fix these values::
de_de: Umleitungen und URL-building funktioniert nur wenn Bottle die öffentliche Adresse und den Ort deiner Anwendung kennt. Nutzt du Bottle lokal hinter einem Reverse-Proxie oder einem Load-Balancer können auf dem Weg Informationen verloren gehen. Zum Beispiel könnte der ``wsgi.url_scheme``-Wert oder der ``Host``-Header die lokale Anfrage deines Proxys widerspiegeln und nicht die echte Anfrage des Clients. Hier ist eine kleines WSGI-Middleware Snipptes welches dir hilft diese Werte zu korrigieren:
