Repository: bottlepy/bottle
Catalog: docs/_locale/*/LC_MESSAGES/index.po
Languages: de_de, ja_jp, pt_br

source: Bottle is a fast, simple and lightweight WSGI_ micro web-framework for Python_. It is distributed as a single file module and has no dependencies other than the `Python Standard Library <http://docs.python.org/library/>`_.
de_de: Bottle ist ein schnelles, einfaches und leichtgewichtiges WSGI_ Mikro-Web-Framework für Python_. Es wird als ein einziges Dateimodul verteilt und hat keine anderen Abhängigkeiten als die `Python Standard Library <http://docs.python.org/library/>`_.
ja_jp: BottleはPython製の早くてシンプルでライトウェイトなWSGIマイクロWebフレームワークです。Bottleは1つのファイルで構成されていて、Pythonの標準ライブラリには依存していません。
pt_br: Bottle é um simples, rápido, e leve WSGI_ micro web-framework para Python_. Ele é distribuído como um único arquivo (módulo) e não tem dependências que além `Biblioteca padrão do Python <http://docs.python.org/library/>`_.

source: **Routing:** Requests to function-call mapping with support for clean and dynamic URLs.
de_de: **Routing:** Abbildung von Anfragen auf Funktionsaufrufe mit Unterstützung für saubere und dynamische URLs.
ja_jp: **ルーティング:** リクエストをファンクションとマッピングします。また、ダイナミックURLもサポートしています。
pt_br: **Rotas:** Solicitações de chamada de função de mapeamento com suporte para URLs limpas e dinâmicos.

source: **Templates:** Fast and pythonic :ref:`built-in template engine <tutorial-templates>` and support for mako_, jinja2_ and cheetah_ templates.
de_de: **Templates:** Schnell und pythonisch :ref:`eigene template engine <tutorial-templates>` und Unterstützung für mako_, jinja2_ and cheetah_ templates.
ja_jp: **テンプレート:** Pythonのビルドインテンプレートやmako、jinja2、cheetahテンプレートをサポートしています。
pt_br: **Templates:**Rápido e pythonico :ref:`mecanismo de templates interno <tutorial-templates>` e suporte para mako_, jinja2_ and cheetah_ templates.

source: **Utilities:** Convenient access to form data, file uploads, cookies, headers and other HTTP-related metadata.
de_de: **Hilfsmittel:** Bequemer Zugriff auf Formulardaten, Dateiuploads, Cookies,Header und andere HTTP-bezogene Metadaten.
ja_jp: ファイルアップロートやクッキー、ヘッダー、その他HTTPに関連するデータに簡単にアクセスすることが可能です。
pt_br: **Utilitários:** Conveniente acesso a dados de formulários, upload de arquivos, cookies, cabeçalhos e outros metadados relacionados ao HTTP.

source: **Server:** Built-in HTTP development server and support for paste_, bjoern_, gae_, cherrypy_ or any other WSGI_ capable HTTP server.
de_de: **Server:** Eingebauter HTTP Entwicklungsserver und Unterstützung für paste_, bjoern_, gae_, cherrypy_ oder jeden anderen WSGI_ fähigen HTTP server.

source: Example: "Hello World" in a bottle
de_de: Beispiel: "Hallo Welt" in einer Flasche
ja_jp: 例: Bottleによる "Hello World"
pt_br: Exemplo: "Olá Mundo" em bottle

source: Run this script or paste it into a Python console, then point your browser to `<http://localhost:8080/hello/world>`_. That's it.
de_de: Führe dieses Skript aus oder füge es in eine Python-Konsole ein, und zeige dann mit Deinem Browser auf `<http://localhost:8080/hello/world>`_. Das war's.
ja_jp: このスクリプトを実行するかPythonコンソールに貼り付けて実行し、ブラウザに次のURLを入力してください。`<http://localhost:8080/hello/world>`
pt_br: Execute este script ou cole em um console de Python, em seguida, acesse em seu navegador o `<http://localhost:8080/hello/world>`_. Feito!

source: Download and Install
de_de: Herunterladen und installieren
ja_jp: ダウンロードとインストール
pt_br: Download e Instalar

source: Install the latest stable release with ``pip install bottle`` or download `bottle.py`__ (unstable) into your project directory. There are no hard [1]_ dependencies other than the Python standard library. Bottle supports **Python 2.7 and Python 3**.
de_de: Installiere die neueste stabile Version mit ``pip install bottle`` oderlade `bottle.py`__ (unstable) in Dein Projektverzeichnis. Es gibt keine harten [1]_ Abhängigkeiten außer der Python-Standardbibliothek. Bottle unterstützt **Python 2.7 und Python 3**.

source: Support for Python 2.5 and 2.6 was dropped with this release.
de_de: Die Unterstützung für Python 2.5 und 2.6 wurde mit dieser Version eingestellt.

source: User's Guide
de_de: Benutzerhandbuch
ja_jp: ユーザーズガイド
pt_br: Guia do usuário

source: Start here if you want to learn how to use the bottle framework for web development. If you have any questions not answered here, feel free to ask the `mailing list <mailto:bottlepy@googlegroups.com>`_.
de_de: Beginne hier, wenn Du lernen willst, wie man das Bottle-Framework für die Webentwicklung verwendet. Wenn Du Fragen hast, die hier nicht beantwortet werden, kannst Du Dich an die `Mailingliste <mailto:bottlepy@googlegroups.com>`_ wenden.
ja_jp: Bottleの使い方はここから調べることができます。ここで分からないことについてはメーリングリスト`<mailto:bottlepy@googlegroups.com>`_で質問してください。
pt_br: Comece por aqui se você quer aprender como usar o bottle framework para desenvolvimento web. Se você tiver quaisquer perguntas não respondidas aqui, sinta-se livre para pedir ajuda a `lista de discussão <mailto:bottlepy@googlegroups.com>`_.

source: Knowledge Base
de_de: Basiswissen
ja_jp: ナレッジベース
pt_br: Base de conhecimento

source: A collection of articles, guides and HOWTOs.
de_de: Eine Sammlung von Artikeln, Anleitungen und HOWTOs
ja_jp: Bottleに関する記事や使い方のノウハウ集です。
pt_br: Uma coleção de artigos, guias e COMO FAZER.

source: Development and Contribution
de_de: Entwicklung und Beteiligung
ja_jp: コントリビューション
pt_br: Desenvolvimento e contribuição

source: These chapters are intended for developers interested in the bottle development and release workflow.
de_de: Diese Kapitel sind für Entwickler gedacht, die sich für den Workflow derFlaschenentwicklung und -freigabe interessieren.
ja_jp: このチャプターはBottleの開発やリリースワークフローに興味のある人向けのコンテンツです。
pt_br: Esses capítulos são destinados a desenvolvedores interessados no desenvolvimento do bottle e entender o fluxo de contribuição.

source: License
de_de: Lizenz
ja_jp: ライセンス
pt_br: Licença

source: Code and documentation are available according to the MIT License:
de_de: Code und Dokumentation sind unter der MIT-Lizenz verfügbar
ja_jp: コードとドキュメントはMITライセンスに応じてご利用いただけます
pt_br: Código e documentação estão disponíveis sobre a licença MIT:

source: The Bottle logo however is *NOT* covered by that license. It is allowed to use the logo as a link to the bottle homepage or in direct context with the unmodified library. In all other cases please ask first.
de_de: Das Bottle-Logo ist jedoch *NICHT* von dieser Lizenz abgedeckt. Es ist erlaubt, das Logo als Link auf die Bottle-Homepage oder im direkten Zusammenhang mit der unveränderten Bibliothek zu verwenden. In allen anderen Fällen fragen Sie bitte vorher nach.
ja_jp: Bottleロゴの利用はライセンスによって制限されていない為、Bottleのホームページへのリンクなどにご利用いただけます。
pt_br: O logotipo do bottle no entanto *NÃO é* abrangido pela licença (MIT). É permitido usar o logotipo como um link para a home page do bottle ou em contexto direto com a biblioteca não modificado. Nos outros casos, por favor, pergunte primeiro.

source: Footnotes
de_de: Fußnoten
ja_jp: 脚注
pt_br: Notas de rodapé

source: Usage of the template or server adapter classes requires the corresponding template or server modules.
de_de: Die Verwendung der Template- oder Server-Adapterklassen erfordert die entsprechenden Template- oder Server-Module.
ja_jp: テンプレートやサーバーアダプタークラスの使用方法は、対応するテンプレートやサーバーモジュールが必要です。

source: Bottle: Python Web Framework
ja_jp: Bottle: Python Webフレームワーク

source: **Server:** Built-in HTTP development server and support for paste_, fapws3_, bjoern_, gae_, cherrypy_ or any other WSGI_ capable HTTP server.
pt_br: **Servidor:** Servidor HTTP interno para desenvolvimento e suporte para paste_, fapws3_, bjoern_, gae_, cherrypy_ ou qualquer outro WSGI_ capaz de servir HTTP
